In [20]:
Series([1,2,4],index=["a","b","c"])
Series([1,2,4],index=list("abc"))
s1 = Series({"A":10,"B":20,'c':30})
s1
s1["B"]
s1.loc["B"]
s1[1]
s1.iloc[1]
s1["A":"c"]
# print(s1.name)

A    10
B    20
c    30
dtype: int64

# Pandas的数据结构

导入pandas： 

数据分析三剑客 numpy pandas matplotlib

In [4]:
import numpy as np

import pandas as pd
from pandas import Series,DataFrame

import matplotlib.pyplot as plt

### 1、Series

Series是一种类似于一维数组的对象，由下面两个部分组成：

- index：相关的数据索引标签
- values：一组数据（ndarray类型）

#### 1）Series的创建

两种创建方式：

(1) 由列表或numpy数组创建

    默认索引为0到N-1的整数型索引

In [200]:
s1 = Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [202]:
s1.index # 索引
s1.values # 值 值是多维数组

array([1, 2, 3, 4], dtype=int64)

    还可以通过设置index参数指定索引

In [4]:
s2 = Series([1,2,3],index=list("abc")) # 通过index可以指定索引 注意：索引的个数和值的个数要对应
s2

a    1
b    2
c    3
dtype: int64

(2) 由字典创建

In [207]:
s3 = Series({"A":10,"B":20,"C":30})
s3

A    10
B    20
C    30
dtype: int64

============================================

练习1：

使用多种方法创建以下Series，命名为s1：  
语文 150   
数学 150   
英语 150   
理综 300   

============================================

In [209]:
s1 = Series([150,150,150,300],index=("语文","数学","英语","理综"))
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

#### 2）Series的索引和切片

可以使用中括号取单个索引（此时返回的是元素类型），或者中括号里一个列表取多个索引（此时返回的仍然是一个Series类型）。分为显示索引和隐式索引：

(1) 显式索引：

    - 使用index中的元素作为索引值
    - 使用.loc[]（推荐）

 注意，此时是闭区间

In [211]:
s2

a    1
b    2
c    3
dtype: int64

In [215]:
s2["a"]
s2.loc["a"] # loc location 定位 根据传入的索引去定位值
s2.loc[["a","c"]] #用于定位的中括号里面 传入的是一个值或者是列表

a    1
c    3
dtype: int64

(2) 隐式索引：

    - 使用整数作为索引值
    - 使用.iloc[]（推荐）

 注意，此时是半开区间

In [216]:
s2

a    1
b    2
c    3
dtype: int64

In [218]:
s2[0]
s2.iloc[0] # iloc index location 通过索引号去定位元素

1

#### 根据索引对Series进行切片

In [220]:
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [223]:
s1.loc["语文":"英语"]
s1["语文":"英语"]
s1[0:3]

语文    150
数学    150
英语    150
dtype: int64

============================================

练习2：

使用多种方法对练习1创建的Series s1进行索引和切片：

索引：
数学 150 

切片：
语文 150 
数学 150 
英语 150 

============================================

In [224]:
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [228]:
s1["数学"]
s1.loc["数学"]
s1[1]
s1.iloc[1]

150

#### 3）Series的常用属性和方法

可以把Series看成一个定长的有序字典

可以通过shape，size，index,values等得到series的属性

In [230]:
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [234]:
s1.shape
s1.size
s1.index
s1.values

array([150, 150, 150, 300], dtype=int64)

可以通过head(),tail()快速查看Series对象的样式

s.head(2)看头两个 s.tail(1)看后一个

In [237]:
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [241]:
s1.head(2)
s1.tail(3)

数学    150
英语    150
理综    300
dtype: int64

当索引没有对应的值时，可能出现缺失数据显示NaN（not a number）的情况

In [11]:
s2 = Series([1,3,5,7,-2,-4,None,np.nan],index=list("abcdefgh"))
s2

a    1.0
b    3.0
c    5.0
d    7.0
e   -2.0
f   -4.0
g    NaN
h    NaN
dtype: float64

In [244]:
ndarr1 = np.array([1,3,5,7,-2,-4,None,np.nan])
ndarr1

array([1, 3, 5, 7, -2, -4, None, nan], dtype=object)

In [250]:
# ndarr1.sum() # 多维数组中 如果有None nan 就没法求和
s2.sum() # Series的sum遇到nan可以当做0 然后求和

10.0

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

可以使用pd.isnull()，pd.notnull()，或自带isnull(),notnull()函数检测缺失数据

In [252]:
s2

a    1.0
b    3.0
c    5.0
d    7.0
e   -2.0
f   -4.0
g    NaN
h    NaN
dtype: float64

In [253]:
s2.isnull() # 是nan则返回True

a    False
b    False
c    False
d    False
e    False
f    False
g     True
h     True
dtype: bool

In [254]:
s2.notnull() # 不是nan返回True

a     True
b     True
c     True
d     True
e     True
f     True
g    False
h    False
dtype: bool

In [258]:
condition = s2.isnull()
condition

a    False
b    False
c    False
d    False
e    False
f    False
g     True
h     True
dtype: bool

In [263]:
s2[condition] = -100

In [264]:
s2

a      1.0
b      3.0
c      5.0
d      7.0
e     -2.0
f     -4.0
g   -100.0
h   -100.0
dtype: float64

Series对象本身及其实例都有一个name属性

In [210]:
s3 = Series([1,2,3,4,5],index=list("abcde"),name="张三")
s3
s3.name

'张三'

In [13]:
s4 = Series([1,2,3,4,5],index=list("abcde"),name="李四")
s4

a    1
b    2
c    3
d    4
e    5
Name: 李四, dtype: int64

#### 4）Series的运算

(1) 适用于numpy的数组运算也适用于Series

In [272]:
s4

a    1
b    2
c    3
d    4
e    5
Name: 李四, dtype: int64

In [274]:
s4 + 50
s4 * 2

a     2
b     4
c     6
d     8
e    10
Name: 李四, dtype: int64

(2) Series之间的运算

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN
- 注意：要想保留所有的index，则需要使用.add()函数

In [275]:
s4

a    1
b    2
c    3
d    4
e    5
Name: 李四, dtype: int64

In [276]:
s3

a    1
b    2
c    3
d    4
e    5
Name: 张三, dtype: int64

In [277]:
s3 + s4 # 索引对应的项目的值会相加

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [278]:
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [279]:
s3

a    1
b    2
c    3
d    4
e    5
Name: 张三, dtype: int64

In [280]:
s1 + s3 # 两个Series进行加和时，如果索引不对应，返回值 nan

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
数学   NaN
理综   NaN
英语   NaN
语文   NaN
dtype: float64

In [282]:
# 索引不对应 就出NaN 如果不喜欢这样可以调用 series自身的add（）方法
s1.add(s3)
s1.add(s3,fill_value=0)

a       1.0
b       2.0
c       3.0
d       4.0
e       5.0
数学    150.0
理综    300.0
英语    150.0
语文    150.0
dtype: float64

============================================

练习3：

1. 想一想Series运算和ndarray运算的规则有什么不同？
    前者索引不匹配时仍可可以运算，只是会显示nan，后者结构不同时无法运算

2. 新建另一个索引包含“文综”的Series s2，并与s2进行多种算术操作。思考如何保存所有数据。

============================================

### 2、DataFrame

DataFrame是一个【表格型】的数据结构；既有行索引，也有列索引。
- 行索引：index
- 列索引：columns
- 值：values（numpy的二维数组）

#### 1）DataFrame的创建

In [22]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame


# 通过 DateFrame 函数 创建
df = DataFrame([1,2,3,4])
df = DataFrame([1,2,3,4],index=list("abcd"))

data = np.random.randint(0,150,size=(4,4))
index = ["张三","李四","王五","赵柳"]
columns = ["Math","Chinese","English","Python"]
df = DataFrame(data,index=index,columns=columns)
df

    Math  Chinese  English  Python
张三   137      116       16      59
李四    80       88       55     107
王五    14       29      129      64
赵柳    31       87      141     144

DataFrame属性：values、columns、index、shape

In [23]:
df.values #所有的值
df.columns # 每一列的标题
df.index #每一行的标题
df.shape

(4, 4)

============================================

练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

In [39]:
data = [[150,0],[150,0],[150,0],[150,0]]
index = ["语文","数学","英语","理综"]
columns = ["张三","李四"]
DataFrame(data=data,index=index,columns=columns)

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  150   0

#### 2）DataFrame的索引

(1) 对列进行索引

    - 通过类似字典的方式
    - 通过属性的方式

 可以将DataFrame的列获取为一个Series。返回的Series拥有原DataFrame相同的索引，且name属性也已经设置好了，就是相应的列名。

In [40]:
# 每一行是一个样本 每一列是描述这个样本的维度
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [42]:
df["Math"] # 按照字典的方式去从DataFrame里取数据
type(df["Math"])

pandas.core.series.Series

In [43]:
df.Math

张三    58
李四    31
王五    59
赵柳    24
Name: Math, dtype: int32

(2) 对行进行索引

    - 使用.loc[]加index来进行行索引
    - 使用.iloc[]加整数来进行行索引
    
 同样返回一个Series，index为原来的columns。

In [45]:
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [48]:
#df["张三"] # columns才能以索引的方式去取 index不行
# df.loc["张三"]
df.iloc[0]

Math        58
Chinese    119
English     94
Python      95
Name: 张三, dtype: int32

In [ ]:
# 总结
# columns 才能以索引的形式去找 df["列名"] df.列名
# index 不能用索引的方式去找 只能用 loc[] 和 iloc[] 去定位内容

(3) 对元素进行索引
    - 使用列索引
    - 使用行索引(iloc[3,1]相当于两个参数;iloc[[3,3]] 里面的[3,3]看做一个参数)
    - 使用values属性（二维numpy数组）

In [49]:
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [53]:
df["Math"].loc["张三"]
df["Math"].iloc[0]

58

In [57]:
df.loc["张三"]
type(df.loc["张三"])
df.loc["张三"].loc["Math"]

58

In [24]:
# DataFrame自带的方式
df.loc["张三","Math"]
df.loc["Math","张三"] # loc是DataFrame提供的定位元素的方法 可以传入行的名称去查找整行
# 也可以 先传入行名称 再传入列名称 去定位元素
# 但是 不能直接把列的名称放前面

KeyError: 'Math'

In [61]:
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [62]:
# 终极方式
df.values[0,0]

58

【注意】
直接用中括号时：
- 索引表示的是列索引
- 切片表示的是行切片

In [63]:
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [64]:
df["Math"] #df后面跟中括号作为索引的话 只能传入列名 对列进行索引 行不行

df[0:3] #df后面的中括号中 如果传的是切片的方式 是对行进行切片

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52

In [65]:
df["Math":"English"] # 如果想对列进行切片

Empty DataFrame
Columns: [Math, Chinese, English, Python]
Index: []

In [73]:
df.iloc[:,0:2] # 需要通过iloc才能对列进行切片

    Math  Chinese
张三    58      119
李四    31        7
王五    59       24
赵柳    24        2

============================================

练习5：

使用多种方法对df进行索引和切片，并比较其中的区别

============================================

#### 3）DataFrame的运算

（1） DataFrame和数值的运算

In [74]:
df

    Math  Chinese  English  Python
张三    58      119       94      95
李四    31        7       42     124
王五    59       24       10      52
赵柳    24        2       88      36

In [75]:
df+1 # 所有内容都加一

    Math  Chinese  English  Python
张三    59      120       95      96
李四    32        8       43     125
王五    60       25       11      53
赵柳    25        3       89      37

In [80]:
df

    Math  Chinese  English  Python
张三    58      119       94      96
李四    31        7       42     125
王五    59       24       10      53
赵柳    24        2       88      37

In [81]:
# df["Python"] = df["Python"]+1
df["Python"]+=1

In [82]:
df

    Math  Chinese  English  Python
张三    58      119       94      97
李四    31        7       42     126
王五    59       24       10      54
赵柳    24        2       88      38

In [ ]:
df["Python"]["张三"] +=1

（2） DataFrame与DataFrame之间的运算

同Series一样：

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN

下面是Python 操作符与pandas操作函数的对应表：

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

In [33]:
df1 = DataFrame(np.random.randint(0,150,size=(5,5)),
                index=list("01234"),
                columns=list("ABCD1"))
df2 = DataFrame(np.random.randint(0,150,size=(5,5)),
                index=list("12345"),
                columns=list("ABCDE"))
display(df1,df2)

     A    B    C    D    1
0   29    9   24  129   53
1  137   35  144   25    6
2   44   63  127  132   66
3   34  115   18  121   47
4  136   82   48   32  131

     A    B    C   D    E
1   71   88  110  58  111
2   43   74  104  24   25
3   74  145  112  68  131
4  111  117  136  83  134
5  128  142   51  69   24

In [34]:
df1+df2 # 行和列索引名都对应 则 对应项相加， 否则为NaN

    1      A      B      C      D   E
0 NaN    NaN    NaN    NaN    NaN NaN
1 NaN  208.0  123.0  254.0   83.0 NaN
2 NaN   87.0  137.0  231.0  156.0 NaN
3 NaN  108.0  260.0  130.0  189.0 NaN
4 NaN  247.0  199.0  184.0  115.0 NaN
5 NaN    NaN    NaN    NaN    NaN NaN

（3） DataFrame和Series之间的运算

In [38]:
df1 = DataFrame(data=np.random.randint(0,150,size=(5,5)),index=list("ABCDE"),columns=list("01234"))
s1 = Series(data=np.random.randint(0,150,size=5),index=list("01234"))
s2 = Series(data=np.random.randint(0,150,size=5),index=list("ABCDE"))
df1

     0    1   2    3    4
A  146  112  89    4   48
B   19   50  94  140   19
C   55   82   6  110   41
D   26   30  22   13  120
E   80  136   8    4  143

In [39]:
s1

0    143
1     20
2     28
3     73
4     38
dtype: int32

In [40]:
df1+s1 #series的索引和DataFrame的列索引对应 则每一行对应项相加

     0    1    2    3    4
A  289  132  117   77   86
B  162   70  122  213   57
C  198  102   34  183   79
D  169   50   50   86  158
E  223  156   36   77  181

In [41]:
s2

A    98
B    33
C    72
D    83
E    81
dtype: int32

In [42]:
df1

     0    1   2    3    4
A  146  112  89    4   48
B   19   50  94  140   19
C   55   82   6  110   41
D   26   30  22   13  120
E   80  136   8    4  143

In [47]:
df1+s2 #默认是 Series的索引和DataFrame的列索引去对应 然后相加
df1.add(s2,axis=0)

     0    1    2    3    4
A  244  210  187  102  146
B   52   83  127  173   52
C  127  154   78  182  113
D  109  113  105   96  203
E  161  217   89   85  224

============================================

练习6：

1. 假设df1是期中考试成绩，df2是期末考试成绩，请自由创建df1和df2，并将相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================

In [103]:
index = ["张三","李四"]
columns = ["语文","数学","英语"]
data = np.random.randint(0,150,size=(2,3))
df1 = DataFrame(data,index=index,columns=columns)
df1

     语文   数学  英语
张三    7  114  39
李四  149  112  50

In [104]:
index = ["张三","李四"]
columns = ["语文","数学","英语"]
data = np.random.randint(0,150,size=(2,3))
df2 = DataFrame(data,index=index,columns=columns)
df2

     语文   数学  英语
张三   20  149  31
李四  136    6  93

In [106]:
(df1+df2)/2

       语文     数学    英语
张三   13.5  131.5  35.0
李四  142.5   59.0  71.5

In [107]:
df1

     语文   数学  英语
张三    7  114  39
李四  149  112  50

In [111]:
df1["数学"].loc["张三"]
df1.loc["张三"].loc["数学"]=0

In [112]:
df1

     语文   数学  英语
张三    7    0  39
李四  149  112  50

In [114]:
df1.loc["李四"]+=100

In [115]:
df1

     语文   数学   英语
张三    7    0   39
李四  249  212  150

In [119]:
df1+=10

In [120]:
df1

     语文   数学   英语
张三   17   10   49
李四  259  222  160